In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame(np.arange(9).reshape(3,3))

In [3]:
df

   0  1  2
0  0  1  2
1  3  4  5
2  6  7  8

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
0    3 non-null int32
1    3 non-null int32
2    3 non-null int32
dtypes: int32(3)
memory usage: 116.0 bytes

In [5]:
df = pd.DataFrame(np.arange(9).reshape(3,3), columns=list("ABC"))

In [6]:
df

   A  B  C
0  0  1  2
1  3  4  5
2  6  7  8

In [7]:
df['A']

0    0
1    3
2    6
Name: A, dtype: int32

In [8]:
df[['A','C']]

   A  C
0  0  2
1  3  5
2  6  8

In [9]:
df['A'][1]

3

In [10]:
df.A  # Not recom.

0    0
1    3
2    6
Name: A, dtype: int32

In [11]:
df[:2]['A']

0    0
1    3
Name: A, dtype: int32

In [12]:
df[:1][:]

   A  B  C
0  0  1  2

In [13]:
sales = pd.read_csv('sales.txt')

In [14]:
sales

  Month  Book City  Units
0   JAN  B100  VZG   10.0
1   FEB  B100  VZG    4.0
2   MAR  B100  VZG   13.0
3   JAN  B100  HYD   30.0
4   FEB  B100  HYD   40.0
5   MAR  B100  HYD   10.0
6   JAN  B200  VZG   14.0
7   FEB  B200  HYD    NaN
8   MAR  B200  NaN    4.0

In [15]:
sales.describe()

          Units
count   8.00000
mean   15.62500
std    12.78322
min     4.00000
25%     8.50000
50%    11.50000
75%    18.00000
max    40.00000

In [16]:
sales.describe(include='all')

       Month  Book City     Units
count      9     9    8   8.00000
unique     3     2    2       NaN
top      MAR  B100  VZG       NaN
freq       3     6    4       NaN
mean     NaN   NaN  NaN  15.62500
std      NaN   NaN  NaN  12.78322
min      NaN   NaN  NaN   4.00000
25%      NaN   NaN  NaN   8.50000
50%      NaN   NaN  NaN  11.50000
75%      NaN   NaN  NaN  18.00000
max      NaN   NaN  NaN  40.00000

In [17]:
sales

  Month  Book City  Units
0   JAN  B100  VZG   10.0
1   FEB  B100  VZG    4.0
2   MAR  B100  VZG   13.0
3   JAN  B100  HYD   30.0
4   FEB  B100  HYD   40.0
5   MAR  B100  HYD   10.0
6   JAN  B200  VZG   14.0
7   FEB  B200  HYD    NaN
8   MAR  B200  NaN    4.0

In [18]:
sales

  Month  Book City  Units
0   JAN  B100  VZG   10.0
1   FEB  B100  VZG    4.0
2   MAR  B100  VZG   13.0
3   JAN  B100  HYD   30.0
4   FEB  B100  HYD   40.0
5   MAR  B100  HYD   10.0
6   JAN  B200  VZG   14.0
7   FEB  B200  HYD    NaN
8   MAR  B200  NaN    4.0

In [19]:
sales.loc[0,'Units']

10.0

In [20]:
sales.head()

  Month  Book City  Units
0   JAN  B100  VZG   10.0
1   FEB  B100  VZG    4.0
2   MAR  B100  VZG   13.0
3   JAN  B100  HYD   30.0
4   FEB  B100  HYD   40.0

In [21]:
sales.loc[ sales.City == 'VZG' , ['Book','Units'] ]

   Book  Units
0  B100   10.0
1  B100    4.0
2  B100   13.0
6  B200   14.0

In [22]:
units = sales.loc[ : , 'Units']

In [23]:
type(units)

pandas.core.series.Series

In [24]:
det = sales.loc[ : , ['Book','Units']]

In [25]:
type(det)

pandas.core.frame.DataFrame

In [26]:
sales.index

RangeIndex(start=0, stop=9, step=1)

In [27]:
sales.iloc[0,:]

Month     JAN
Book     B100
City      VZG
Units      10
Name: 0, dtype: object

## Read data about countries

In [28]:
import requests

In [29]:
resp = requests.get("https://restcountries.eu/rest/v2/all")

In [30]:
cdf = pd.DataFrame(resp.json())

In [31]:
cdf.head()

,alpha2Code,alpha3Code,altSpellings,area,borders,callingCodes,capital,cioc,currencies,demonym,...,name,nativeName,numericCode,population,region,regionalBlocs,subregion,timezones,topLevelDomain,translations
0,AF,AFG,"[AF, Afġānistān]",652230.0,"[IRN, PAK, TKM, UZB, TJK, CHN]",[93],Kabul,AFG,"[{'code': 'AFN', 'name': 'Afghan afghani', 'sy...",Afghan,...,Afghanistan,افغانستان,004,27657145,Asia,"[{'acronym': 'SAARC', 'name': 'South Asian Ass...",Southern Asia,[UTC+04:30],[.af],"{'de': 'Afghanistan', 'es': 'Afganistán', 'fr'..."
1,AX,ALA,"[AX, Aaland, Aland, Ahvenanmaa]",1580.0,[],[358],Mariehamn,,"[{'code': 'EUR', 'name': 'Euro', 'symbol': '€'}]",Ålandish,...,Åland Islands,Åland,248,28875,Europe,"[{'acronym': 'EU', 'name': 'European Union', '...",Northern Europe,[UTC+02:00],[.ax],"{'de': 'Åland', 'es': 'Alandia', 'fr': 'Åland'..."
2,AL,ALB,"[AL, Shqipëri, Shqipëria, Shqipnia]",28748.0,"[MNE, GRC, MKD, KOS]",[355],Tirana,ALB,"[{'code': 'ALL', 'name': 'Albanian lek', 'symb...",Albanian,...,Albania,Shqipëria,008,2886026,Europe,"[{'acronym': 'CEFTA', 'name': 'Central Europea...",Southern Europe,[UTC+01:00],[.al],"{'de': 'Albanien', 'es': 'Albania', 'fr': 'Alb..."
3,DZ,DZA,"[DZ, Dzayer, Algérie]",2381741.0,"[TUN, LBY, NER, ESH, MRT, MLI, MAR]",[213],Algiers,ALG,"[{'code': 'DZD', 'name': 'Algerian dinar', 'sy...",Algerian,...,Algeria,الجزائر,012,40400000,Africa,"[{'acronym': 'AU', 'name': 'African Union', 'o...",Northern Africa,[UTC+01:00],[.dz],"{'de': 'Algerien', 'es': 'Argelia', 'fr': 'Alg..."
4,AS,ASM,"[AS, Amerika Sāmoa, Amelika Sāmoa, Sāmoa Amelika]",199.0,[],[1684],Pago Pago,ASA,"[{'code': 'USD', 'name': 'United State Dollar'...",American Samoan,...,American Samoa,American Samoa,016,57100,Oceania,[],Polynesia,[UTC-11:00],[.as],"{'de': 'Amerikanisch-Samoa', 'es': 'Samoa Amer..."

In [32]:
cdf.describe()

               area        gini    population
count  2.400000e+02  153.000000  2.500000e+02
mean   6.262107e+05   40.177124  2.939655e+07
std    1.950028e+06    9.265119  1.244578e+08
min    4.400000e-01   24.000000  0.000000e+00
25%    1.533250e+03   33.700000  2.029030e+05
50%    7.100650e+04   38.600000  4.648734e+06
75%    4.146432e+05   46.200000  1.803955e+07
max    1.712444e+07   65.800000  1.377422e+09

In [33]:
cdf['population']

0       27657145
1          28875
2        2886026
3       40400000
4          57100
5          78014
6       25868000
7          13452
8           1000
9          86295
10      43590400
11       2994400
12        107394
13      24117360
14       8725931
15       9730500
16        378040
17       1404900
18     161006790
19        285000
20       9498700
21      11319511
22        370300
23      10653654
24         61954
25        775620
26      10985059
27         17408
28       3531159
29       2141206
         ...
220     18564000
221     23503349
222      8593600
223     55155000
224     65327652
225      1167242
226      7143000
227         1411
228       103252
229      1349667
230     11154400
231     78741053
232      4751120
233        31458
234        10640
235     33860700
236     42692393
237      9856000
238     65110000
239    323947000
240      3480222
241     31576400
242       277500
243     31028700
244     92700000
245        11750
246       510713
247     27478000
248     15933883
249     14240168
Name: population, Length: 250, dtype: int64

In [34]:
cdf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 250 entries, 0 to 249
Data columns (total 24 columns):
alpha2Code        250 non-null object
alpha3Code        250 non-null object
altSpellings      250 non-null object
area              240 non-null float64
borders           250 non-null object
callingCodes      250 non-null object
capital           250 non-null object
cioc              247 non-null object
currencies        250 non-null object
demonym           250 non-null object
flag              250 non-null object
gini              153 non-null float64
languages         250 non-null object
latlng            250 non-null object
name              250 non-null object
nativeName        250 non-null object
numericCode       249 non-null object
population        250 non-null int64
region            250 non-null object
regionalBlocs     250 non-null object
subregion         250 non-null object
timezones         250 non-null object
topLevelDomain    250 non-null object
translations      250 non-null object
dtypes: float64(2), int64(1), object(21)
memory usage: 47.0+ KB

## 11-FEB

In [35]:
# cdf[ ['alpha3Code','name','capital','population','area']].head()
cdf.loc[:5, ['alpha3Code','name','capital','population','area']]

  alpha3Code            name           capital  population       area
0        AFG     Afghanistan             Kabul    27657145   652230.0
1        ALA   Åland Islands         Mariehamn       28875     1580.0
2        ALB         Albania            Tirana     2886026    28748.0
3        DZA         Algeria           Algiers    40400000  2381741.0
4        ASM  American Samoa         Pago Pago       57100      199.0
5        AND         Andorra  Andorra la Vella       78014      468.0

In [36]:
def get_codes(lst):
    return lst[0]['code']

In [37]:
c = cdf['currencies'].apply(get_codes).head()

In [38]:
c

0    AFN
1    EUR
2    ALL
3    DZD
4    USD
Name: currencies, dtype: object

In [39]:
def get_all_codes(lst):
    codes = []
    for c in lst:
        if 'code' in c and c['code'] is not None:
           codes.append( c['code'])
        
    return ",".join(codes)

In [40]:
cdf['currencies'].apply(get_all_codes).head(25)

0         AFN
1         EUR
2         ALL
3         DZD
4         USD
5         EUR
6         AOA
7         XCD
8     AUD,GBP
9         XCD
10        ARS
11        AMD
12        AWG
13        AUD
14        EUR
15        AZN
16        BSD
17        BHD
18        BDT
19        BBD
20    BYN,BYR
21        EUR
22        BZD
23        XOF
24        BMD
Name: currencies, dtype: object

In [41]:
cdf.loc[8,'currencies']

[{'code': 'AUD', 'name': 'Australian dollar', 'symbol': '$'},
 {'code': 'GBP', 'name': 'British pound', 'symbol': '£'}]

In [42]:
cdf.at[8,'currencies']

[{'code': 'AUD', 'name': 'Australian dollar', 'symbol': '$'},
 {'code': 'GBP', 'name': 'British pound', 'symbol': '£'}]

In [43]:
cor = 10000000

In [44]:
def  has_border(lst):
    return len(lst) > 0

def  has_no_border(lst):
     return  len(lst) == 0

In [45]:
cdf[cdf['borders'].apply(has_no_border)].head()

,alpha2Code,alpha3Code,altSpellings,area,borders,callingCodes,capital,cioc,currencies,demonym,...,name,nativeName,numericCode,population,region,regionalBlocs,subregion,timezones,topLevelDomain,translations
1,AX,ALA,"[AX, Aaland, Aland, Ahvenanmaa]",1580.0,[],[358],Mariehamn,,"[{'code': 'EUR', 'name': 'Euro', 'symbol': '€'}]",Ålandish,...,Åland Islands,Åland,248,28875,Europe,"[{'acronym': 'EU', 'name': 'European Union', '...",Northern Europe,[UTC+02:00],[.ax],"{'de': 'Åland', 'es': 'Alandia', 'fr': 'Åland'..."
4,AS,ASM,"[AS, Amerika Sāmoa, Amelika Sāmoa, Sāmoa Amelika]",199.0,[],[1684],Pago Pago,ASA,"[{'code': 'USD', 'name': 'United State Dollar'...",American Samoan,...,American Samoa,American Samoa,016,57100,Oceania,[],Polynesia,[UTC-11:00],[.as],"{'de': 'Amerikanisch-Samoa', 'es': 'Samoa Amer..."
7,AI,AIA,[AI],91.0,[],[1264],The Valley,,"[{'code': 'XCD', 'name': 'East Caribbean dolla...",Anguillian,...,Anguilla,Anguilla,660,13452,Americas,[],Caribbean,[UTC-04:00],[.ai],"{'de': 'Anguilla', 'es': 'Anguilla', 'fr': 'An..."
8,AQ,ATA,[],14000000.0,[],[672],,,"[{'code': 'AUD', 'name': 'Australian dollar', ...",,...,Antarctica,Antarctica,010,1000,Polar,[],,"[UTC-03:00, UTC+03:00, UTC+05:00, UTC+06:00, U...",[.aq],"{'de': 'Antarktika', 'es': 'Antártida', 'fr': ..."
9,AG,ATG,[AG],442.0,[],[1268],Saint John's,ANT,"[{'code': 'XCD', 'name': 'East Caribbean dolla...","Antiguan, Barbudan",...,Antigua and Barbuda,Antigua and Barbuda,028,86295,Americas,"[{'acronym': 'CARICOM', 'name': 'Caribbean Com...",Caribbean,[UTC-04:00],[.ag],"{'de': 'Antigua und Barbuda', 'es': 'Antigua y..."

In [46]:
cdf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 250 entries, 0 to 249
Data columns (total 24 columns):
alpha2Code        250 non-null object
alpha3Code        250 non-null object
altSpellings      250 non-null object
area              240 non-null float64
borders           250 non-null object
callingCodes      250 non-null object
capital           250 non-null object
cioc              247 non-null object
currencies        250 non-null object
demonym           250 non-null object
flag              250 non-null object
gini              153 non-null float64
languages         250 non-null object
latlng            250 non-null object
name              250 non-null object
nativeName        250 non-null object
numericCode       249 non-null object
population        250 non-null int64
region            250 non-null object
regionalBlocs     250 non-null object
subregion         250 non-null object
timezones         250 non-null object
topLevelDomain    250 non-null object
translations      250 non-null object
dtypes: float64(2), int64(1), object(21)
memory usage: 47.0+ KB

In [47]:
cdf['area'].sort_values(ascending=False).head()

185    17124442.0
8      14000000.0
42      9984670.0
48      9640011.0
239     9629091.0
Name: area, dtype: float64

In [ ]:
cdf.loc[top5.index,['name','region','area','population']]

In [ ]:
cdf[ (cdf['region'] == 'Asia') & (cdf['area'] > 3000000) ]

In [ ]:
cdf.at[0,'alpha3Code']

In [ ]:
cdf.sample(n=10)

In [ ]:
cdf[ ['name','capital','region']].isin({'region': ['Asia','Africa']})

In [ ]:
cdf.info()

In [ ]:
top_den_cl = (cdf['population'] / cdf['area']).sort_values(ascending=False).head()
top_den_cl

In [ ]:
cdf.loc[top_den_cl.index]

In [ ]:
nd = pd.DataFrame({'name' : cdf['name'], 'borders' : cdf['borders'].str.join(",")})

In [ ]:
nd

In [ ]:
sales

In [ ]:
sales.loc[:,['City','Units']].apply(lambda s : s.count())

In [ ]:
sales.applymap(lambda v : 'Null' if v is np.nan else v)

In [ ]:
sales

In [ ]:
sales.info()

In [ ]:
sales = sales.append( {'Month':'FEB','Book' : 'B300', 'City': 'VZG','Units' : 10}, ignore_index=True)

In [ ]:
sales

In [ ]:
sales.loc[:5, ['Year']] = 2018

In [ ]:
sales['Diff'] = sales['Units'] - 5

In [ ]:
sales.drop(['Year','Diff'], axis=1, inplace=True)

In [ ]:
sales

In [ ]:
cdf['strborders'] = cdf['borders'].str.join(",")

In [ ]:
cdf['strborders'].head()

In [ ]:
cdf.head()

In [ ]:
df = pd.DataFrame({'c1':[1,2], 'c2': [100,200]})

In [ ]:
df

In [ ]:
df = df.set_index('c1')

In [ ]:
df

In [ ]:
df.loc[2,:]

In [ ]:
cdf.set_index(['alpha3Code'])

In [ ]:
sales

In [ ]:
sales.sort_values(['Month'])

In [ ]:
sales.sort_index()

In [ ]:
sdf = sales.copy()

In [ ]:
sdf.drop([4],axis=0, inplace=True)

In [ ]:
sdf = sdf.reset_index()

In [ ]:
sdf.columns

In [ ]:
sdf.drop(['index'], axis=1, inplace=True)

In [ ]:
sdf

In [ ]:
sales.sort_values(['Month','Book','City'])

In [ ]:
cdf['region'].value_counts()

In [ ]:
sales['Book'].value_counts()

In [ ]:
sales

In [ ]:
cdf['region'].nunique()

In [ ]:
sales.isna().any(axis=1)

In [ ]:
sales.loc[ sales.isna().any(axis=1), :]

In [ ]:
sales['Book'].isna().any()

In [ ]:
sales.info()

In [ ]:
sales.loc[ :,sales.notna().all()]

In [ ]:
sales.dropna()

In [ ]:
sales.fillna(0)